[
    {
        "title": "Coconut Rum Brazilian Lemonade",
        "ingredients": [
            "2 limes",
            "2 cups water",
            "1/2 cup coconut rum",
            "1/4 cup sweetened condensed milk",
            "2 cups ice"
        ],
        "steps": [
            "Rinse limes and cut the ends off.  Cut each lime in 8 wedges and add to a blender.  Add water, coconut rum, and sweetened condensed milk; blend until creamy. ",
            "Fill 3 glasses with ice and strain lemonade over."
        ]
    },
    {
        "title": "Celery Margarita",
        "ingredients": [
            "1 tablespoon kosher salt",
            "1/4 teaspoon ground coriander",
            "1 lime wedge",
            "ice, as needed",
            "1 1/2 fluid ounces tequila",
            "1 1/2 fluid ounces celery cordial",
            "3/4 fluid ounce lime juice",
            "3 dashes celery bitters (optional)",
            "leafy celery stalk, for garnish"
        ],
        "steps": [
            "Mix salt and coriander together on a small plate. Wipe rim of a margarita glass with lime wedge. Dip rim in salt mixture to coat. Fill glass with crushed ice. ",
            "Fill a cocktail shaker half full with ice. Add tequila, celery cordial, lime juice, and bitters to shaker; cover and shake until outside of shaker is frosted, about 60 seconds. Strain into prepared glass and garnish with celery stalk. From the Editor: Find the recipe for Celery Cordial here."
        ]
    },
    {
        "title": "Mint Julep Sweet Tea",
        "ingredients": [
            "3 cups water",
            "3/4 cups fresh mint",
            "1/2 cup sugar",
            "4 tangerine orange herbal tea bags, such as Celestial Seasonings® Tangerine Orange Zinger",
            "6 fluid ounces bourbon",
            "16 mint leaves, optional",
            "4 slices lemon"
        ],
        "steps": [
            "Bring water, the 3/4 cup mint, and sugar to a boil in a saucepan. Remove from heat and add tea bags. Steep for 1 hour.",
            "Strain mixture into a pitcher and add bourbon. Stir until combined.",
            "Muddle 4 mint leaves in a glass. Fill halfway with ice, add a lemon slice, and fill with more ice. Add tea bourbon mixture; garnish with a mint sprig and a lemon wedge."
        ]
    },
    {
        "title": "Banana Pudding Milkshake",
        "ingredients": [
            "1 cup 1% milk",
            "2 cups vanilla frozen yogurt",
            "1 banana, divided",
            "1 (.9 ounce) package sugar-free banana cream pudding mix",
            "1/2 cup vanilla wafers, divided"
        ],
        "steps": [
            "Add milk and frozen yogurt to the jar of a blender. Slice banana; set 4 to 6 slices aside for garnish. Add remaining banana and pudding mix to the blender. Set 2 vanilla wafers aside for garnish; add remaining vanilla wafers to the blender. Blend until smooth.",
            "Pour mixture into 2 tall glasses. Top each milkshake with whipped cream, remaining banana slices, and a vanilla wafer."
        ]
    },
    {
        "title": "Watermelon Sour Patch Cocktail",
        "ingredients": [
            "sugar as needed, for rim",
            "1 lime wedge",
            "2 cups ice, or as needed",
            "2 fluid ounces strawberry schnapps",
            "2 fluid ounces vanilla vodka",
            "2 fluid ounces sweet and sour mix"
        ],
        "steps": [
            "Pour 1/4 to 1/2 inch of sugar onto a small, shallow plate. Moisten rim of a rocks glass with a wedge of lime, dip the moistened glass into sugar; set aside.",
            "Scoop ice into a shaker. Pour in strawberry schnapps, vanilla vodka, and sweet and sour mix;  cover and shake until the outside is frosted. Strain into a chilled glass."
        ]
    },
    {
        "title": "Thai Basil Mojito",
        "ingredients": [
            "2 cups ice, or as needed",
            "1 fluid ounce fresh lime juice",
            "3/4 fluid ounce simple syrup",
            "12 fresh Thai basil leaves",
            "1 1/2 fluid ounces rum",
            "2 fluid ounces club soda",
            "lime wedge (optional)",
            "1 Thai basil sprig (optional)"
        ],
        "steps": [
            "Fill a collins glass with ice and set aside.",
            "In a cocktail shaker, combine lime juice, simple syrup and Thai basil leaves. Use a muddler to crush the leaves for about 10 seconds. Add rum and 1 cup of ice. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.",
            "Strain mojito into the glass and top with club soda; gently stir. Garnish with lime wedge and Thai basil sprig, if desired."
        ]
    },
    {
        "title": "Pineapple Smoothie",
        "ingredients": [
            "1 1/2 cups cubed pineapple, frozen",
            "1 banana, sliced and frozen",
            "1 cup canned coconut milk",
            "1/2 teaspoon coconut extract",
            "1/2 teaspoon vanilla extract"
        ],
        "steps": [
            "Combine pineapple, banana, coconut milk, coconut extract, and vanilla in a blender cup; blend until smooth. Serve immediately. Cook’s Note Add more coconut milk if smoothie is on the thick side."
        ]
    },
    {
        "title": "Thai Iced Coffee",
        "ingredients": [
            "ice as needed",
            "4 ounces milk",
            "2 shots espresso",
            "1/8 teaspoon cardamom",
            "2 tablespoons sweetened condensed milk"
        ],
        "steps": [
            "Fill a 16 ounce glass with ice. Add milk. Add cardamom to espresso and stir to combine. Pour into glass. Top with sweetened condensed milk."
        ]
    },
    {
        "title": "Gin and Jam Cocktail",
        "ingredients": [
            "2 fluid ounces gin",
            "1 tablespoon jam, blackberry or any flavor",
            "3/4 fluid ounce fresh lemon juice",
            "1/2 fluid ounce simple syrup",
            "1 cup ice cubes",
            "1 cup crushed ice",
            "1 mint leaf, for garnish",
            "1 splash club soda (optional)"
        ],
        "steps": [
            "Place gin, jam, lemon juice,and simple syrup in a cocktail shaker, along with 1 cup ice cubes. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.",
            "Fill a glass with crushed ice; strain cocktail into the glass. Top with a splash of club soda, if desired. Garnish with mint leaf."
        ]
    },
    {
        "title": "Tequila Old Fashioned",
        "ingredients": [
            "4 maraschino cherries, stems removed, divided",
            "1 orange slice",
            "6 ice cubes, or more if desired",
            "2 fluid ounces anejo tequila",
            "1 fluid ounce Cointreau",
            "3 dashes bitters",
            "1 orange twist"
        ],
        "steps": [
            "Place orange slice and 2 cherries in a rocks glass, and crush with a muddler. Add ice cubes to glass. Add tequila, Cointreau and bitters; stir. Garnish with additional 2 cherries and an orange twist."
        ]
    },
    {
        "title": "Coconut Margarita",
        "ingredients": [
            "2 fluid ounces silver tequila",
            "1 1/2 fluid ounces freshly squeezed lime juice",
            "1 1/4 fluid ounces freshly squeezed orange juice",
            "1 fluid ounce cream of coconut",
            "1 fluid ounce coconut milk"
        ],
        "steps": [
            "Fill a cocktail shaker with ice. Add tequila, lime juice, orange juice, cream of coconut, and coconut milk. Shake until tequila mixture is completely chilled and cream of coconut is incorporated, about 30 seconds. Pour into glass. Serve immediately. Cook’s Note Be sure to use cream of coconut and not coconut cream. Cream of coconut is sweeter and normally used for mixed drinks."
        ]
    },
    {
        "title": "Mango Colada",
        "ingredients": [
            "3/4 cup frozen pineapple chunks",
            "1/2 cup frozen mango chunks",
            "2 fluid ounces rum",
            "2 fluid ounces pineapple juice",
            "2 fluid ounces cream of coconut",
            "2 fluid ounces coconut milk"
        ],
        "steps": [
            "Place frozen pineapple, frozen mango, rum, pineapple juice, cream of coconut, and coconut milk in a blender cup and blend until smooth. Serve immediately. Cook’s Note Be sure to use cream of coconut and not coconut cream. Cream of coconut is sweeter and normally used for mixed drinks."
        ]
    },
    {
        "title": "Frozen Fruit Smoothie",
        "ingredients": [
            "9 ounces pineapple juice",
            "2 cups assorted frozen fruit (your choice)",
            "1 frozen banana, cut into chunks",
            "1 cup vanilla Greek yogurt (such as Cabot® 2%)"
        ],
        "steps": [
            "Add juice, frozen fruit, frozen banana, and yogurt to the jar of a blender, and process until smooth. If too thick, add a little more pineapple juice until you reach your desired consistency.",
            "Pour into glasses and serve. Cook’s Note I raid the freezer when I want to make smoothies, since I always keep frozen fruit on hand. To make this even easier, you can buy a bag of frozen assorted fruit at the grocery store. If you have smoothie leftovers (or intentionally make more than you know you’ll need), fill popsicle molds for the next day. The kids will love them, and it’s a great way to get them to eat their fruit. You will need a high-powered blender because of the frozen fruit. Otherwise, let the frozen fruit thaw just a bit and add some extra juice and yogurt to your blender."
        ]
    },
    {
        "title": "Spicy Mango Margarita",
        "ingredients": [
            "1 lime wedge",
            "1 teaspoon chili-lime seasoning (such as Tajin®)",
            "2 cups ice, or as needed",
            "2 fluid ounces silver tequila",
            "3 jalapeno slices, or more to taste",
            "4 fluid ounces mango nectar",
            "3/4 fluid ounces triple sec or other orange liqueur",
            "3/4 fluid ounces lime juice"
        ],
        "steps": [
            "Sprinkle chili lime seasoning onto a plate. Moisten the rim of a glass with lime wedge. Press the moistened rim into the seasoning. Fill the glass with ice.",
            "Fill a cocktail shaker with tequila and 2 jalapeno slices. Use a muddler to crush the peppers. Add mango nectar, triple sec, and lime juice to the shaker and add 1 cup of ice. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.",
            "Strain margarita into the glass and garnish with remaining jalapeno slice, if desired."
        ]
    },
    {
        "title": "Cafe de Olla",
        "ingredients": [
            "4 cups water",
            "1/3 cup grated piloncillo, or to taste",
            "1 stick Mexican cinnamon",
            "1/4 cup ground coffee"
        ],
        "steps": [
            "Place water, piloncillo, and cinnamon in a pot. Bring to a boil, reduce heat, and simmer for 8 minutes.",
            "Remove from heat, add coffee, and stir well. Cover pot and steep for 5 minutes. Pour through a fine mesh strainer twice or until free of any coffee granules."
        ]
    },
    {
        "title": "Spicy Pineapple Margarita",
        "ingredients": [
            "1 lime wedge",
            "1 teaspoon chili-lime seasoning (such as Tajin®)",
            "2 cups ice, or as needed",
            "2 fluid ounces silver tequila",
            "3 jalapeno slices, or more to taste",
            "4 fluid ounces pineapple juice",
            "3/4 fluid ounces triple sec or other orange liqueur",
            "3/4 fluid ounces lime juice"
        ],
        "steps": [
            "Sprinkle chili lime seasoning onto a plate. Moisten the rim of a glass with lime wedge. Press the moistened rim into the seasoning. Fill the glass with ice.",
            "Fill a cocktail shaker with tequila and 2 jalapeno slices. Use a muddler to crush the peppers. Add pineapple juice, triple sec, and lime juice to the shaker and add 1 cup of ice. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.",
            "Strain margarita into the glass and garnish with remaining jalapeno slice, if desired."
        ]
    },
    {
        "title": "Skinny Margarita",
        "ingredients": [
            "kosher salt as needed",
            "1 lime wedge",
            "1 3/4 fluid ounces silver tequila",
            "1 1/2 fluid ounces freshly squeezed lime juice",
            "1 1/4 fluid ounces freshly squeezed orange juice",
            "1 teaspoon agave syrup, or to taste"
        ],
        "steps": [
            "Pour salt onto a plate. Rub a lime wedge around the rim of a glass, and dip the rim of the glass in the salt.",
            "Fill a cocktail shaker with ice. Add tequila, lime juice, orange juice, and agave syrup. Close the shaker and shake until completely chilled, about 30 seconds. Pour into the salted glass. Serve immediately."
        ]
    },
    {
        "title": "Violet Gin Fizz",
        "ingredients": [
            "ice as needed",
            "1 1/2 fluid ounces gin",
            "1 large pasteurized egg white, or 2 tablespoons aquafaba (liquid from canned chickpeas)",
            "3/4 fluid ounce lemon juice",
            "3/4 fluid ounce simple syrup",
            "1/2 fluid ounce crème de violette",
            "2 dashes lavender bitters (optional)",
            "1 1/2 fluid ounces chilled club soda",
            "2 lemon wheels, for garnish"
        ],
        "steps": [
            "Fill a cocktail shaker half full with ice. Add gin, egg white, lemon juice, simple syrup, crème de violette, and bitters. Cover and shake until outside of shaker is frosted, about 30 seconds.",
            "Strain into a measuring cup; discard ice. Return cocktail to shaker; cover and shake until pressure builds and mixture starts to emulsify, about 45 seconds.",
            "Pour club soda into a glass. Slowly strain cocktail into glass, allowing foam to rise. Garnish with lemon wheel."
        ]
    },
    {
        "title": "Spicy Carrot-Ginger Sipper",
        "ingredients": [
            "1 lime, halved crosswise",
            "3 slices fresh ginger, plus more for garnish",
            "1 sprig fresh mint",
            "ice as needed",
            "2 fluid ounces purchased carrot juice",
            "1 ounce silver tequila",
            "1/2 fluid ounce chile liqueur or Ancho Syrup (see recipe, below)",
            "1 1/2 fluid ounces ginger beer"
        ],
        "steps": [
            "Cut 1 lime half into 4 pieces; add to a cocktail shaker with ginger and mint sprig. Muddle mixture until combined, well crushed, and juicy, about 1 minute.",
            "Fill the cocktail shaker half full with ice. Add carrot juice, tequila, and chile liqueur to shaker; cover and shake until outside of shaker is frosted, about 60 seconds. Strain into an ice-filled cocktail glass and top with ginger beer. Cut a lime wheel from remaining lime half. Garnish cocktail with lime wheel and ginger slices. Cook’s Note For a booze-free version, omit tequila and increase carrot juice to 3 ounces. Omit chile liqueur and substitute 1/2 ounce Ancho Syrup.Ancho Syrup: ​​Seed 1 dried ancho chile and tear into pieces; add to a small saucepan with 1/2 cup each sugar and water. Bring to a boil, stirring until sugar is dissolved. Remove from heat. Let steep, covered, 20 minutes. Strain out chile solids. Chill in an airtight container for up to 1 week."
        ]
    },
    {
        "title": "Lillet Sours",
        "ingredients": [
            "ice as needed",
            "3 fluid ounces Lillet Blanc ",
            "1 fluid ounce rye whiskey",
            "1 fluid ounce Cointreau",
            "1 fluid ounce lemon juice",
            "1 fluid ounce simple syrup",
            "lemon wheels, for garnish"
        ],
        "steps": [
            "Fill a cocktail shaker 3/4 full with ice. Add Lillet Blanc, whiskey, Cointreau, lemon juice, and simple syrup. Cover and shake until outside of shaker is frosted, about 30 seconds. Strain into 2 glasses and garnish with lemon wheels."
        ]
    },
    {
        "title": "Big Batch Hugo Spritz",
        "ingredients": [
            "6 sprigs fresh mint",
            "6 slices lime",
            "1 (750 ml) bottle chilled Prosecco",
            "3/4 cup chilled sparkling water",
            "3 fluid ounces St-Germain elderflower liqueur",
            "lime wheels and additional fresh mint, for garnish",
            "ice as needed"
        ],
        "steps": [
            "Muddle mint in a 1-quart. pitcher. Stir in prosecco, sparkling water, and elderflower liqueur. Garnish with lime wheels and additional mint. Serve in ice-filled glasses."
        ]
    },
    {
        "title": "Black-Eyed Susan Cocktails",
        "ingredients": [
            "ice as needed",
            "4 ounces orange juice",
            "2 ounces lemon juice",
            "2 ounces simple syrup",
            "2 ounces bourbon",
            "2 ounces vodka",
            "2 ounces peach schnapps",
            "orange slices and maraschino cherries, for garnish"
        ],
        "steps": [
            "Fill a cocktail shaker half full with ice. Add 2 ounces orange juice and 1 ounce each lemon juice, simple syrup, bourbon, vodka, and schnapps. Cover and shake until outside of shaker is frosted, about 30 seconds.",
            "Strain into an ice-filled highball glass. Repeat with remaining ingredients. Garnish each glass with orange slices and a cherry."
        ]
    },
    {
        "title": "Starbucks Copycat Honey Oatmilk Latte",
        "ingredients": [
            "3/4 cup oat milk",
            "2 tablespoons honey, or to taste",
            "1/2 cup hot coffee",
            "1/4 teaspoon ground cinnamon (optional)"
        ],
        "steps": [
            "Place oat milk and honey in a tall, microwave-safe cup and heat until hot, 1 to 2 minutes. Stir until well combined. Froth hot oat milk mixture with an immersion blender or with a frothing wand.",
            "Pour coffee into a cup. Using the back of a spoon pour frothed milk over coffee. Pour foam over frothed milk. Sprinkle with cinnamon."
        ]
    },
    {
        "title": "Spicy Lemon Ginger Switchel",
        "ingredients": [
            "1 cup water",
            "2 tablespoons unfiltered apple cider vinegar",
            "1 tablespoon fresh lemon juice",
            "4 teaspoons honey",
            "1 teaspoon grated fresh ginger",
            "1 pinch ground cayenne pepper"
        ],
        "steps": [
            "Place water, apple cider vinegar, lemon juice, honey, fresh ginger, and cayenne pepper in a glass jar. Stir or shake well to combine."
        ]
    },
    {
        "title": "Te de Canela (Cinnamon Tea)",
        "ingredients": [
            "1 1/2 cups water",
            "1 1/2 sticks Ceylon cinnamon, broken into pieces",
            "choice of sweetener, such as honey, sugar, or piloncillo (optional)",
            "1/2 teaspoon lemon juice, or as needed (optional)"
        ],
        "steps": [
            "Place water and cinnamon sticks in a pot and bring to a boil. Reduce heat and simmer for 10 minutes. Strain tea and pour into a cup; add sweetener and lemon juice as desired."
        ]
    },
    {
        "title": "Cinnamon Tea",
        "ingredients": [
            "2 cups water",
            "6 (4-inch) cinnamon sticks",
            "4 lemon slices, or as needed",
            "4 teaspoons honey, or to taste"
        ],
        "steps": [
            "Bring water and cinnamon sticks to a boil in a small saucepan over medium-high heat. Cover, reduce heat, and simmer for about 5 minutes.",
            "Remove from heat and allow to steep for an additional 5 minutes. Serve warm, with lemon slices and a teaspoon of honey."
        ]
    },
    {
        "title": "Instant Gingerbread Hot Chocolate",
        "ingredients": [
            "1 cup cocoa",
            "1 cup white sugar",
            "1/2 cup brown sugar",
            "2 teaspoons ground ginger",
            "1 teaspoon ground cinnamon",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon salt",
            "1 pinch cayenne pepper (optional)"
        ],
        "steps": [
            "Add cocoa, white sugar, brown sugar, ginger, cinnamon, cloves, salt, and cayenne to a bowl, and whisk thoroughly to combine.",
            "Store in an airtight container until needed. Be sure to stir very thoroughly before each use.",
            "To make hot chocolate, heat milk over medium heat until it almost starts to simmer. Whisk in 2 tablespoons of instant gingerbread hot chocolate mix per 1 cup milk.",
            "Once everything is mixed together and dissolved, and the milk is piping hot, transfer into mugs and enjoy. John Mitzewich Chef's Note: I used a Dutch-processed cocoa powder for this recipe. Dutch processing lowers the acidity of the cocoa."
        ]
    },
    {
        "title": "Rich Almond Milk Eggnog",
        "ingredients": [
            "1 duck egg",
            "1 cup vanilla almond milk",
            "1 tablespoon white sugar",
            "1/4 teaspoon vanilla extract",
            "2 tablespoons non-dairy whipped topping",
            "1 pinch ground nutmeg"
        ],
        "steps": [
            "Crack duck egg into a glass bowl. Using an electric wire whip, whip egg until yellow and frothy. Add almond milk, sugar, and vanilla; whip until combined.",
            "Divide beverage between two cups. Garnish with non-dairy whipped topping and freshly grated nutmeg. Serve immediately. From the Editor: This recipe contains raw egg. We recommend that pregnant women, young children, older adults, and the immunocompromised do not consume raw egg. Learn more about egg safety from our article, How to Make Your Eggs Safe."
        ]
    },
    {
        "title": "Aperol Sour",
        "ingredients": [
            "1 1/2 fluid ounces Aperol",
            "1 1/2 fluid ounces gin",
            "1 fluid ounce fresh lemon juice",
            "1 fluid ounce simple syrup",
            "1 large egg white",
            "2 dashes bitters, such as Angostura Bitters®",
            "1 cup ice"
        ],
        "steps": [
            "Combine Aperol, gin, lemon juice, simple syrup, egg white, and bitters in a cocktail shaker. Shake mixture until frothy, 30 to 45 seconds. Add ice to shaker, and shake again until chilled, 15 to 30 seconds more. Strain into chilled coupe. Garnish with an additional dash of bitters, if desired."
        ]
    },
    {
        "title": "Crema di Limoncello (Cream of Limoncello)",
        "ingredients": [
            "12 lemons, zested",
            "1 (750 mL) bottle Everclear 190 proof",
            "1 1/2 quarts whole milk",
            "7 1/2 cups white sugar",
            "1 (3g) packet powdered pure vanilla extract, such as Paneangeli® Vanillina, or  1 teaspoon vanilla extract",
            "3 (750 mL) decorative bottles with tight-fitting lids, or more if bottles are smaller"
        ],
        "steps": [
            "Wash and scrub the lemons to remove any wax or residue. Remove the peel of the lemons with a vegetable peeler or very sharp knife, being careful to only remove the yellow part, and none of the white pith.",
            "Place the lemon zest in a large glass jar with a tight-fitting lid. Pour Everclear over lemon zest, replace and tighten the lid. Let sit at room temperature in a dark place for at least 2 weeks.",
            "Pour milk and sugar in a large heavy-bottomed pan over medium heat, and heat until sugar is fully dissolved and mixture is hot but not boiling, stirring occasionally. Stir in powdered vanilla extract or liquid vanilla extract. Remove from heat and cool completely.",
            "Using a fine sieve or cheesecloth, strain lemon mixture into milk mixture, removing all of the lemon zest; mix well. Pour into a container that has a pour spout, decant into decorative bottles, and store in the freezer."
        ]
    },
    {
        "title": "Mulled Cranberry Juice",
        "ingredients": [
            "4 cups cranberry juice cocktail",
            "1/4 cup white sugar",
            "3 whole cloves",
            "1 cinnamon stick, plus more for serving",
            "1 or 2 small navel oranges, thinly sliced, plus more for serving"
        ],
        "steps": [
            "Combine cranberry juice cocktail, granulated sugar, whole cloves, cinnamon stick, and orange slices in a 4-quart saucepan over medium heat.",
            "Bring to a boil; stir until sugar dissolves. Reduce heat to low and simmer for 10 to 20 minutes.",
            "Allow to cool slightly, and ladle into punch cups. Float one orange slice in each cup and garnish with a cinnamon stick. Serve warm. Cook’s Note If you wish, eliminate the sugar and stir in 1/2 cup of Cointreau or other orange flavored liqueur, after taking the mixture off of the heat, prior to serving."
        ]
    },
    {
        "title": "Sugar Cookie Martini",
        "ingredients": [
            "1 teaspoon vanilla icing, or as needed",
            "1 teaspoon sprinkles, or as needed",
            "1 cup ice, or as needed",
            "3 fluid ounces rum cream liqueur (such as RumChata®)",
            "1 1/2 ounces vanilla vodka",
            "1/4 ounce Amaretto"
        ],
        "steps": [
            "Rim martini glass with icing and sprinkles; set aside.",
            "Fill a cocktail shaker with ice; pour in rum cream, vodka, and amaretto. Cover and shake until the outside of shaker has frosted. Strain into a chilled glass."
        ]
    },
    {
        "title": "Salted Caramel Apple Shots",
        "ingredients": [
            "2 tablespoons caramel sauce, divided",
            "1/2 teaspoon flaky sea salt (such as Maldon Sea Salt®)",
            "ice as needed",
            "3 ounces vodka",
            "4 ounces apple cider",
            "1 teaspoon fresh squeezed lemon juice",
            "1/8 teaspoon cinnamon",
            "green apple slices, for garnish"
        ],
        "steps": [
            "Reserve 2 teaspoons caramel sauce. Dip one side of the rim of each shot glass in remaining caramel  and sprinkle each with about 1/8 teaspoon salt.",
            "Fill cocktail shaker half way with ice.  Add vodka, apple cider, lemon juice, cinnamon, and remaining caramel sauce. Shake well and pour into prepared shot glasses.  Garnish with a small apple slice if desired. Dotdash Meredith Food Studios"
        ]
    },
    {
        "title": "Grinch Punch",
        "ingredients": [
            "2 quarts lime sherbet, sitting at room temperature for a few minutes to soften",
            "1 (1 liter) bottle chilled lemon-lime soda (such as Sprite®)",
            "8 cups (1/2 gallon) chilled Hawaiian Punch® Green Berry Rush® juice drink",
            "2 cups chilled pineapple juice, plus more for coating glass rims",
            "1 glass red sanding sugar, for coating glass rims"
        ],
        "steps": [
            "Scoop softened lime sherbet into the bottom of a large punch bowl.",
            "Pour the lemon-lime soda, Hawaiian Punch, and 2 cups pineapple juice over the sherbet and stir.",
            "Place red sanding sugar in a shallow dish, and some additional pineapple juice in a separate shallow dish. Dip the rims of your serving glasses in the pineapple juice, then in the sanding sugar to coat the rims generously.",
            "Ladle the punch into the prepared glasses."
        ]
    },
    {
        "title": "Korean Banana Milk",
        "ingredients": [
            "1 banana",
            "1/2 cup whole milk",
            "1/2 cup cold water",
            "1 tablespoon pure maple syrup",
            "1 teaspoon vanilla",
            "4 to 5 ice cubes (optional)"
        ],
        "steps": [
            "Combine banana, milk, water, maple syrup and vanilla in the blender cup. Blend until smooth.",
            "Place ice cubes in glass (if using). Pour banana milk on top."
        ]
    },
    {
        "title": "Tamarind Margarita",
        "ingredients": [
            "1 tablespoon chili-lime seasoning (such as Tajin®)",
            "1 lime wedge",
            "2 cups ice, or as needed",
            "2 ounces tamarind paste concentrate",
            "1 1/2 fluid ounces silver tequila",
            "1 fluid ounce agave nectar",
            "1 fluid ounce lime juice",
            "1/2 fluid ounce triple sec"
        ],
        "steps": [
            "Sprinkle chili-lime seasoning onto a plate. Moisten the rim of a glass with the lime wedge. Press the moistened rim into the seasoning. Fill glass with ice.",
            "Fill a cocktail shaker half-full with ice. Add tamarind paste, tequila, agave nectar, lime juice and triple sec to the shaker. Seal and shake vigorously until outside is frosted, 10 to 15 seconds. Strain mixture into the glass. Garnish with the lime wedge."
        ]
    },
    {
        "title": "Key Lime Pie Shake",
        "ingredients": [
            "1 1/3 cups vanilla ice cream",
            "1/4 cup 1% milk",
            "2 tablespoons Key lime juice",
            "2 squares graham crackers, divided",
            "2 tablespoons sweetened condensed milk",
            "2 tablespoons whipped cream",
            "1/4 teaspoon zest and 1 wedge from 1 Key lime"
        ],
        "steps": [
            "Add ice cream, milk, key lime juice, 1 graham cracker square, and sweetened condensed milk to the jar of a blender. Blend on high until smooth.",
            "Pour milkshake into a glass; top with whipped cream and zest. To garnish, break remaining graham square in half, and place one graham into whipped cream, then crumble remaining graham over milkshake. Cut a lime wedge and tuck into whipped cream."
        ]
    },
    {
        "title": "Cucumber-Lime Tonic",
        "ingredients": [
            "1 English cucumber, peeled",
            "2 fluid ounces fresh lime juice",
            "1 1/2 tablespoons sugar",
            "2 cups ice",
            "8 fluid ounces tonic water",
            "2 slices lime, for serving"
        ],
        "steps": [
            "Cut two thin slices from cucumber and set aside for garnish. Chop remaining cucumber into large chunks and place in blender with lime juice and sugar. Blend until smooth. Strain the cucumber mixture through a fine strainer into a jar. You should have about 8 ounces.",
            "Fill two glasses with ice. Divide the mixture between the glasses, about 4 ounces each. Top each glass with 4 ounces of tonic water. Garnish with a cucumber and lime slice and serve."
        ]
    },
    {
        "title": "Spanish Gin and Tonic (Gin Tonica)",
        "ingredients": [
            "whole spices, such as juniper berries, pink peppercorns, star anise, cardamom pods, cloves, or cinnamon sticks",
            "2 fluid ounces gin",
            "4 to 6 fluid ounces tonic water, to taste",
            "sliced fresh citrus fruit, such as lemon, orange, lime, or blood orange",
            "fresh herbs, such as basil, thyme, mint, rosemary, or tarragon"
        ],
        "steps": [
            "Fill a large red wine glass with fresh ice almost to the top.",
            "Add whole spices to the glass. These should be chosen to compliment the botanicals in the gin, and some common choices include juniper berries, peppercorns, star anise, cardamom pods, cloves, and cinnamon sticks. For a more pronounced flavor, whole spices can be “bruised” by pressing with your fingers, or the flat of a knife before adding. ",
            "Pour in gin. Then very slowly and gently pour in tonic, so as not to lose the carbonation. For best results, use a “Mediterranean style” tonic instead of the classic Indian style, since they tend to be less bitter, and often include flavors like rosemary and lemon.",
            "Add slices and/or zest from the citrus fruit(s) of your choice. Use a cocktail stirrer or spoon to gently poke the ingredients down, and mix the drink. Do not stir vigorously! ",
            "Push in the fresh herb sprigs. Common choices are basil, thyme, mint, rosemary, or tarragon. For a stronger, more fragrant effect, slap the herbs between your hands, or squeeze between your fingers to activate the essential oils.",
            "Serve 3 to 5 minutes after mixing to give drink time to chill thoroughly. Chef John"
        ]
    },
    {
        "title": "Mango Daiquiri",
        "ingredients": [
            "1 cup frozen mango chunks",
            "2 fluid ounces rum",
            "2 fluid ounces freshly squeezed lime juice",
            "2 fluid ounces agave syrup"
        ],
        "steps": [
            "Place mangoes, rum, lime juice, and agave syrup in blender cup and blend until smooth."
        ]
    },
    {
        "title": "Apple Smoothie",
        "ingredients": [
            "1 small banana, peeled and frozen",
            "1 large Fuji apple, cored and sliced",
            "3/4 cup whole milk plain Greek yogurt",
            "1/4 cup unsweetened apple juice",
            "3 tablespoons rolled oats",
            "1 tablespoon almond butter",
            "2 teaspoons maple syrup, or to taste",
            "1 pinch ground cinnamon",
            "1 pinch ground nutmeg",
            "1 pinch ground cloves"
        ],
        "steps": [
            "Place banana, apple, yogurt, apple juice, oats, almond butter, maple syrup, cinnamon, nutmeg, and cloves into the cup of a high speed blender, and blend until smooth. If desired, add ice for a thicker smoothie, or add milk for a thinner consistency."
        ]
    },
    {
        "title": "Apple, Strawberry, and Banana Smoothie",
        "ingredients": [
            "3/4 cup vanilla almond milk",
            "1 apple - peeled, cored, and cubed",
            "1 cup halved frozen strawberries",
            "1 frozen banana, peeled and cubed",
            "1/4 cup vanilla Greek yogurt (such as Cabot® 2% lowfat vanilla Greek yogurt)"
        ],
        "steps": [
            "Place almond milk, apple, strawberries, banana, and yogurt in a blender, being sure the milk goes in first. Process until smooth, occasionally scraping down the sides of the blender with a rubber spatula, if necessary.",
            "Pour into serving glasses and serve immediately."
        ]
    },
    {
        "title": "Charred Lemon Paper Plane",
        "ingredients": [
            "1 lemon",
            "1 pinch sugar",
            "ice as needed",
            "3/4 ounce bourbon",
            "3/4 ounces Aperol",
            "3/4 ounce amaro (such as Cardamaro®)",
            "charred lemon twist, for garnish"
        ],
        "steps": [
            "Halve lemon and sprinkle cut sides with sugar.",
            "Preheat an outdoor grill to medium heat (350 degrees F to 375 degrees F (175 degrees C to 190 degrees C)) or preheat a grill pan over medium-high heat. Grill lemon, cut sides down, until lightly charred, about 5 minutes. Let cool; juice lemon to yield 3/4 ounce juice.",
            "Fill a cocktail shaker half full with ice. Add bourbon, Aperol, amaro, and lemon juice. Cover and shake until outside of shaker is frosted, 30 seconds. Strain into a glass. Garnish with a lemon twist. From the Editor Amaro Nonino is the standard liqueur for paper plane cocktails, but we like Cardamaro for its notes of fall spices. Averna, Cynar, or Montenegro would work well, too. To char the lemon twist, carefully singe with a lighter."
        ]
    },
    {
        "title": "Harissa-Pomegranate Mocktail",
        "ingredients": [
            "1 1/2 fl ounces brewed Lapsang souchong black tea, cooled",
            "1 1/2 ounces pomegranate juice",
            "3/4 ounce lemon juice",
            "3/4 ounce harissa simple syrup",
            "1/2 ounce aquafaba (liquid from canned chickpeas)",
            "dash of rose water",
            "ice as needed",
            "pink peppercorns, for garnish"
        ],
        "steps": [
            "Combine tea, pomegranate juice, lemon juice, harissa simple syrup, aquafaba, and rose water in a cocktail shaker. Cover and shake until pressure builds and mixture starts to emulsify, about 45 seconds. Add ice to shaker. Cover and shake until outside of shaker is frosted, about 30 seconds. Strain into a glass. Garnish with pink peppercorns. From the Editor Chill leftover aquafaba (liquid from canned chickpeas), covered, up to 1 week and use as a plant-based egg white replacement in meringues, marshmallows, mousses, and mayonnaise. Or use purchased aquafaba powder and follow package directions. We love Vör and Saheli brands. Find them both at Whole Foods or on Amazon."
        ]
    },
    {
        "title": "Maple Rum Flip",
        "ingredients": [
            "1 1/2 ounces aged rum (such as Appleton Estate®)",
            "1/2 ounce orange liqueur (such as Cointreau®)",
            "1/2 ounce pure maple syrup",
            "1 pasteurized whole egg",
            "ice as needed",
            "1 sprig fresh rosemary",
            "freshly grated fresh nutmeg, for garnish"
        ],
        "steps": [
            "Combine rum, orange liqueur, maple syrup, and egg in a cocktail shaker. Cover and shake until pressure builds and mixture starts to emulsify, about 45 seconds. Add ice and rosemary to shaker. Cover and shake until outside of shaker is frosted, about 30 seconds. Strain into a glass. Garnish with nutmeg."
        ]
    },
    {
        "title": "Apple Fall Spritz",
        "ingredients": [
            "ice as needed",
            "2 apple slices",
            "1 fresh sage leaf",
            "3 ounces dry hard apple cider",
            "2 ounces Aperol",
            "splash of club soda"
        ],
        "steps": [
            "Fill a glass with ice. Nestle apple and sage in glass. Pour hard cider and Aperol into glass, then top with club soda."
        ]
    },
    {
        "title": "Spiked Strawberry Lemonade",
        "ingredients": [
            "1 cup sliced fresh strawberries",
            "1/2 cup freshly squeezed lemon juice",
            "3 cups water, divided",
            "2 tablespoons white sugar, or to taste (optional)",
            "1 cup vodka, divided",
            "ice, as needed"
        ],
        "steps": [
            "Combine strawberries, lemon juice, and 1 cup water in a blender; blend until smooth.",
            "Pour into a pitcher and add remaining 2 cups water. Taste; add sugar as desired.",
            "Fill each glass with ice, add 2 ounces vodka per glass, and top off with strawberry lemonade."
        ]
    },
    {
        "title": "Gold Rush",
        "ingredients": [
            "1/4 cup honey",
            "2 tablespoons water",
            "2 cups ice",
            "2 fluid ounces bourbon",
            "3/4 fluid ounce honey syrup",
            "3/4 fluid ounce fresh lemon juice",
            "lemon twist, for garnish"
        ],
        "steps": [
            "In a small saucepan, combine honey and water over medium heat. Bring to a simmer, stirring, until honey is dissolved. Remove from heat and cool completely. To account for evaporation, add a splash of water to bring the total volume of syrup up to 3 fluid ounces, if necessary.",
            "Add 1 cup of ice to a cocktail shaker. Add bourbon, honey syrup and lemon juice. Cover and shake until chilled, 15 to 20 seconds. Fill a rocks glass with remaining ice cubes or 1 large ice sphere and strain cocktail over the ice. Garnish with lemon twist. Cook's Note: Honey syrup recipe makes enough syrup for 4 cocktails. Editorial Note: Nutrition data for this recipe includes the full amount of honey syrup; the actual amount consumed will vary."
        ]
    },
    {
        "title": "Sparkling Peach Sangria",
        "ingredients": [
            "1 (750 ml) bottle Prosecco, well chilled",
            "2 peaches, thinly sliced",
            "1 cup Cointreau liqueur",
            "2 limes, thinly sliced, divided",
            "1 tablespoon torn fresh mint leaves",
            "1 (1-inch) piece fresh ginger, finely grated",
            "12 ounces sparkling water, or to taste",
            "2 tablespoons mint leaves for garnish (optional)"
        ],
        "steps": [
            "Early in the day, refrigerate prosecco. Combine peach slices, Cointreau, half of lime slices, mint leaves, and grated ginger in a container with a lid. Refrigerate at least 6 hours, making sure peaches are submerged in liquid.",
            "When ready to serve, pour peach mixture into a large serving pitcher and add prosecco. Stir briefly to combine.",
            "Place some of the fruit in each glass, add sangria, and top with 2 ounces sparkling water, or to taste. Garnish with reserved lime slices and additional mint leaves, if desired."
        ]
    },
    {
        "title": "Copycat Chick-fil-A Frosted Lemonade",
        "ingredients": [
            "4 cups vanilla ice cream",
            "12 ounces frozen lemonade concentrate",
            "1 teaspoon lemon zest"
        ],
        "steps": [
            "Place ice cream, frozen lemonade concentrate, and lemon zest in the jar of a blender, and blend until smooth. Divide into 4 glasses, and serve immediately. Dotdash Meredith Video Studios"
        ]
    },
    {
        "title": "Agua Fresca de Fresas con Crema (Strawberries and Cream)",
        "ingredients": [
            "2 1/2 pounds strawberries, hulled and diced, divided",
            "2 cups water",
            "1 (14 1/2 ounce) can sweetened condensed milk",
            "1 (12 ounce) can evaporated milk",
            "1 tablespoon vanilla",
            "1/2 cup sugar, or as needed",
            "3 cups ice cubes, or as needed"
        ],
        "steps": [
            "Place 2 pounds of the strawberries and water in a blender cup and blend until smooth.",
            "Pour strawberry puree into a large pitcher. Add sweetened condensed milk, evaporated milk, and vanilla. Stir until well incorporated. Taste; add sugar, a little at a time, as needed.",
            "Add ice cubes and stir. Gently stir in remaining 1/2 pound diced strawberries. Chill until ready to serve."
        ]
    },
    {
        "title": "Sparkling Mango Pineapple Sangria",
        "ingredients": [
            "1/2 cup pineapple juice",
            "1/2 cup mango juice",
            "1/2 cup pineapple rum",
            "1/2 cup mango rum",
            "1/2 fresh pineapple - peeled, cored, and cut into chunks",
            "2 mangos - peeled, seeded, and sliced",
            "1 (750mL) bottle Prosecco sparkling wine"
        ],
        "steps": [
            "Stir pineapple juice, mango juice, pineapple rum, mango rum, chunked pineapple, and mango slices together in a large pitcher. Chill for 2 to 4 hours.",
            "Add Prosecco before serving. Stir and serve cold."
        ]
    },
    {
        "title": "How to Make Cold Foam",
        "ingredients": [
            "1/4 cup skim milk",
            "1 1/2 to 2 teaspoons vanilla simple syrup (see above) or purchased vanilla syrup (Optional)",
            "2 cups cold brew coffee or iced coffee",
            "freshly grated nutmeg or cinnamon (Optional)"
        ],
        "steps": [
            "Gather all ingredients. Dotdash Meredith Food Studios",
            "Combine milk and simple syrup in a small measuring cup. Dotdash Meredith Food Studios",
            "Submerge the end of a milk frother in the mixture. Dotdash Meredith Food Studios Recipe Tip If you don’t have a frother, you can make cold foam in a clean French press coffee maker. Plunge the lid repeatedly to froth the mixture.",
            "Froth until consistently foamy, 15 to 20 seconds for skim milk or 2 to 3 minutes for almond milk. Dotdash Meredith Food Studios",
            "Divide cold brew coffee between 2 glass mugs. Dotdash Meredith Food Studios",
            "Spoon cold foam over coffee. Sprinkle with nutmeg or cinnamon. Dotdash Meredith Food Studios"
        ]
    },
    {
        "title": "Big-Batch Pineapple-Basil Vodka Sours",
        "ingredients": [
            "1 1/2 cups chopped fresh pineapple",
            "1 (750-ml) bottle vodka",
            "1/2 cup fresh basil leaves, plus more for garnish",
            "1 cup sugar",
            "1 cup water",
            "1 cup freshly-squeezed lime juice (about limes)",
            "1 cup freshly-squeezed lemon juice (about 6 lemons)",
            "ice as needed",
            "club soda as needed (optional)",
            "fresh pineapple weges and fronds, for garnish"
        ],
        "steps": [
            "For pineapple-basil vodka, put pineapple in a 1-quart jar. Top with vodka, cover, and let stand until vodka is infused with pineapple flavor, 1 to 3 days. Add basil, cover, and infuse for 1 to 2 hours; strain.   Meanwhile for the DIY sour mix, combine sugar and water in a saucepan and bring to a boil over high heat, stirring until sugar is dissolved. Remove from heat; let cool. Add lime juice and lemon juice. Chill in the refrigerator for at least 1 hour and up to 1 week.",
            "In a pitcher, stir together pineapple-basil vodka and DIY sour mix. Serve in rocks glasses over ice. Top with club soda (if using); garnish with pineapple wedges, fronds, and additional basil. Cook's Note: Consider this the only vodka sour recipe you’ll ever need. For a single cocktail, shake together 1 ½ ounce pineapple-basil vodka and 1 ½ ounce DIY sour mix in a shaker, then strain and serve over ice. More Infused Flavors: For bumbleberry vodka, put 1 1/2 cups mixed blackberries, raspberries, and lightly smashed blueberries in a 1-quart jar. Top with 1 (750-ml bottle) vodka; let stand, covered, 1 to 3 days to infuse. Add half of a split vanilla bean and let stand, covered, 1 to 2 hours; strain.For cucumber-mint vodka, put 1 1/2 cups chopped fresh English cucumber in a 1-quart jar. Top with 1 (750-ml bottle) vodka; let stand, covered, 1 to 3 days to infuse. Add 1/4 cup fresh mint leaves and let stand, covered, 1 to 2 hours; strain.For peach-thyme vodka, put 1 1/2 cups chopped fresh peaches in a 1-quart jar. Top with 1 (750-ml bottle) vodka; let stand, covered, 1 to 3 days to infuse. Add 2 to 4 sprigs fresh thyme and let stand, covered, 1 to 2 hours; strain., put 11/2 cups chopped fresh peaches in a 1-qt. jar. Top with 1 (750-ml bottle) vodka; let stand, covered, 1 to 3 days to infuse. Add 2 to 4 sprigs fresh thyme and let stand, covered, 1 to 2 hours; strain."
        ]
    },
    {
        "title": "Copycat Wendy’s Chocolate Frosty",
        "ingredients": [
            "2 cups chocolate milk",
            "1 cup frozen whipped topping (do not thaw)",
            "1/4 cup whole milk",
            "1 tablespoon sweetened condensed milk"
        ],
        "steps": [
            "Pour chocolate milk into ice cube trays and freeze until solid, at least 4 hours and up to 24.   Process frozen milk cubes, frozen whipped topping, whole milk, and sweetened condensed milk in a food processor until smooth. Serve immediately or freeze in an airtight container up to 1 week. Cook's Note: For easier blending, transfer frozen milk cubes to a zip-top bag, then pound with a meat mallet or rolling pin into small pieces."
        ]
    },
    {
        "title": "Chocolate Cream Cold Brew",
        "ingredients": [
            "2 tablespoons heavy whipping cream",
            "1 tablespoon milk",
            "1 1/2 teaspoons chocolate syrup (such as Torani® Sugar Free Syrup)",
            "1 1/2 teaspoons cocoa powder",
            "1/2 teaspoon vanilla extract",
            "1 cup cold brew coffee"
        ],
        "steps": [
            "Add heavy whipping cream, milk, chocolate syrup, cocoa powder and vanilla into a tall glass. Whip with a milk frother until until desired consistency is reached.",
            "Serve over cold brew coffee."
        ]
    },
    {
        "title": "Chilton Cocktail",
        "ingredients": [
            "1 tablespoon coarse salt, or as needed",
            "1 lemon wedge",
            "1 ½  fluid ounces freshly-squeezed lemon juice",
            "1 ½ fluid ounces vodka",
            "4 fluid ounces sparkling mineral water, or as needed"
        ],
        "steps": [
            "Sprinkle salt onto a plate. Moisten the rim of a highball glass with lemon wedge. Press the moistened rim into salt. Fill the glass with ice.",
            "Pour lemon juice and vodka over ice and gently stir. Top with sparkling water and serve with lemon wedge."
        ]
    },
    {
        "title": "Stone-Cold Stinger",
        "ingredients": [
            "½ fluid ounce cinnamon schnapps (i.e. Goldschlager™)",
            "½ fluid ounce peppermint schnapps",
            "½ fluid ounce Jagermeister liqueur"
        ],
        "steps": [
            "Gather all ingredients. Dotdash Meredith Food Studios",
            "Pour cinnamon schnapps, peppermint schnapps, and Jagermeister into a frozen shot glass. Dotdash Meredith Food Studios"
        ]
    },
    {
        "title": "Sparkling Cantaloupe Agua Fresca",
        "ingredients": [
            "2 pounds fresh cantaloupe cubes (6 cups)",
            "2 cups water",
            "6 tablespoons freshly squeezed lime juice (from 2 limes)",
            "3 tablespoons honey",
            "1/4 teaspoon salt",
            "2 cups club soda, chilled",
            "cantaloupe melon balls or cubes, for garnish ",
            "lime zest twists, for garnish"
        ],
        "steps": [
            "Working in batches if needed, blend cantaloupe, water, lime juice, honey, and salt in a blender until smooth. Press through a sieve; discard solids. Add strained juice to a pitcher.",
            "Chill until ready to serve. Add club soda just before serving. Serve over ice, and garnish glasses with melon balls and lime zest twists."
        ]
    },
    {
        "title": "Agua Fresca de Pithaya (Dragon Fruit)",
        "ingredients": [
            "2 lb pink- or white-flesh pithayas",
            "1 1/2 cups water",
            "1/4 cup lime juice",
            "2 tablespoons sugar",
            "lime wheels, for garnish",
            "ice cubes as needed"
        ],
        "steps": [
            "Cut pithayas in half and scoop out flesh. Blend pithaya flesh, the water, lime juice, and sugar in a blender until smooth. Pour over ice and garnish glasses with lime wheels."
        ]
    }
]